htibosch/freertos_plus_projects/plus/Framework/FreeRTOS-Plus-FAT/portable/STM32F7xx/ff_sddisk.older.c
/*
 * FreeRTOS+FAT V2.3.3
 * Copyright (C) 2021 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * https://www.FreeRTOS.org
 * https://github.com/FreeRTOS
 *
 */

/* Standard includes. */
#include <stdlib.h>
#include <string.h>
#include <stdarg.h>
#include <stdio.h>

/* FreeRTOS includes. */
#include "FreeRTOS.h"
#include "task.h"
#include "semphr.h"
#include "portmacro.h"

/* FreeRTOS+FAT includes. */
#include "ff_sddisk.h"
#include "ff_sys.h"

#include "eventLogging.h"

/* ST HAL includes. */
#ifdef STM32F7xx
	#include "stm32f7xx_hal.h"
#else
	#include "stm32f4xx_hal.h"
#endif

/* Misc definitions. */
#define sdSIGNATURE         0x41404342U
#define sdHUNDRED_64_BIT    ( ( uint64_t ) 100U )
#define sdBYTES_PER_MB      ( ( uint64_t ) 1024U * 1024U )
#define sdSECTORS_PER_MB    ( ( uint64_t ) sdBYTES_PER_MB / 512U )
#define sdIOMAN_MEM_SIZE    4096

#define CACHE_LINE_BITS     0x1FU
#define CACHE_LINE_SIZE     32U

/* Define a time-out for all DMA transactions in msec. */
#ifndef sdMAX_TIME_TICKS
	#define sdMAX_TIME_TICKS    pdMS_TO_TICKS( 2000U )
#endif

#ifndef configSD_DETECT_PIN
	#error configSD_DETECT_PIN must be defined in FreeRTOSConfig.h to the pin used to detect if the SD card is present.
#endif

#ifndef configSD_DETECT_GPIO_PORT
	#error configSD_DETECT_GPIO_PORT must be defined in FreeRTOSConfig.h to the port on which configSD_DETECT_PIN is located.
#endif

#ifndef sdCARD_DETECT_DEBOUNCE_TIME_MS
	/* Debouncing time is applied only after card gets inserted. */
	#define sdCARD_DETECT_DEBOUNCE_TIME_MS    ( 5000 )
#endif

#ifndef sdARRAY_SIZE
	#define sdARRAY_SIZE( x )    ( int ) ( sizeof( x ) / sizeof( x )[ 0 ] )
#endif

#ifdef STM32F7xx

/* This driver was originally developed for STM32F4xx.
 * With a few defines it can also be used for STM32F7xx : */
/* The Instance of the MMC peripheral. */
	#if ( STM_USE_SDMMC2 == 1 )
		#define SDIO                SDMMC2
		#define SDIO_IRQ_number     SDMMC2_IRQn
		#define SDIO_IRQ_Handler    SDMMC2_IRQHandler
		/* DMA constants. */

		/* DMA constants. */
		#define SD_DMAx_Tx_CHANNEL                   DMA_CHANNEL_11
		#define SD_DMAx_Rx_CHANNEL                   DMA_CHANNEL_11

		#define SD_DMAx_Tx_STREAM                    DMA2_Stream5
		#define SD_DMAx_Rx_STREAM                    DMA2_Stream0
		#define SD_DMAx_Tx_IRQn                      DMA2_Stream5_IRQn
		#define SD_DMAx_Rx_IRQn                      DMA2_Stream0_IRQn

		#define DMA2_TX_stream_IRQHandler            DMA2_Stream5_IRQHandler
		#define DMA2_RX_stream_IRQHandler            DMA2_Stream0_IRQHandler

		#define __DMAx_TxRx_CLK_ENABLE               __DMA2_CLK_ENABLE
		#define configSDIO_DMA_INTERRUPT_PRIORITY    ( configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY )
	#else /* if ( STM_USE_SDMMC2 == 1 ) */
		#define SDIO                                 SDMMC1
		#define SDIO_IRQ_number                      SDMMC1_IRQn
		#define SDIO_IRQ_Handler                     SDMMC1_IRQHandler

		/* DMA constants. */
		#define SD_DMAx_Tx_CHANNEL                   DMA_CHANNEL_4
		#define SD_DMAx_Rx_CHANNEL                   DMA_CHANNEL_4

		#define SD_DMAx_Tx_STREAM                    DMA2_Stream6
		#define SD_DMAx_Rx_STREAM                    DMA2_Stream3
		#define SD_DMAx_Tx_IRQn                      DMA2_Stream6_IRQn
		#define SD_DMAx_Rx_IRQn                      DMA2_Stream3_IRQn

		#define DMA2_TX_stream_IRQHandler            DMA2_Stream6_IRQHandler
		#define DMA2_RX_stream_IRQHandler            DMA2_Stream3_IRQHandler

		#define __DMAx_TxRx_CLK_ENABLE               __DMA2_CLK_ENABLE
		#define configSDIO_DMA_INTERRUPT_PRIORITY    ( configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY )
	#endif /* if ( STM_USE_SDMMC2 == 1 ) */

	#define SDIO_CLOCK_EDGE_RISING                   SDMMC_CLOCK_EDGE_RISING
	#define SDIO_CLOCK_BYPASS_DISABLE                SDMMC_CLOCK_BYPASS_DISABLE
	#define SDIO_CLOCK_POWER_SAVE_DISABLE            SDMMC_CLOCK_POWER_SAVE_DISABLE
	#define SDIO_BUS_WIDE_1B                         SDMMC_BUS_WIDE_1B
	#define SDIO_BUS_WIDE_4B                         SDMMC_BUS_WIDE_4B
	#define SDIO_HARDWARE_FLOW_CONTROL_DISABLE       SDMMC_HARDWARE_FLOW_CONTROL_DISABLE


	#define SD_SDIO_DISABLED                         SD_SDMMC_DISABLED
	#define SD_SDIO_FUNCTION_BUSY                    SD_SDMMC_FUNCTION_BUSY
	#define SD_SDIO_FUNCTION_FAILED                  SD_SDMMC_FUNCTION_FAILED
	#define SD_SDIO_UNKNOWN_FUNCTION                 SD_SDMMC_UNKNOWN_FUNCTION

#endif /* STM32F7xx */

/*-----------------------------------------------------------*/

/*
 * Return pdFALSE if the SD card is not inserted.  This function just reads the
 * value of the GPIO C/D pin.
 */
static BaseType_t prvSDDetect( void );

/*
 * Translate a numeric code like 'SD_TX_UNDERRUN' to a printable string.
 */
static const char * prvSDCodePrintable( uint32_t ulCode );

/*
 * The following 'hook' must be provided by the user of this module.  It will be
 * called from a GPIO ISR after every change.  Note that during the ISR, the
 * value of the GPIO is not stable and it can not be used.  All you can do from
 * this hook is wake-up some task, which will call FF_SDDiskDetect().
 */
extern void vApplicationCardDetectChangeHookFromISR( BaseType_t * pxHigherPriorityTaskWoken );

