htibosch/freertos_plus_projects/plus/Framework/FreeRTOS-Plus-FAT/portable/STM32F7xx/ff_sddisk.older.c
/*
 * Hardware initialisation.
 */
static void prvSDIO_SD_Init( void );
static void vGPIO_SD_Init( SD_HandleTypeDef * xSDHandle );

/*
 * Check if the card is present, and if so, print out some info on the card.
 */
static BaseType_t prvSDMMCInit( BaseType_t xDriveNumber );

#if ( SDIO_USES_DMA != 0 )

/*
 * Initialise the DMA for SDIO cards.
 */
	static void prvSDIO_DMA_Init( void );
#endif

#if ( SDIO_USES_DMA != 0 )

/*
 * A function will be called at the start of a DMA action.
 */
	static void prvEventSetupFunction( SD_HandleTypeDef * pxHandle );
#endif

#if ( SDIO_USES_DMA != 0 )

/*
 * This function is supposed to wait for an event: SDIO or DMA.
 * Return non-zero if a timeout has been reached.
 */
	static uint32_t prvEventWaitFunction( SD_HandleTypeDef * pxHandle );
#endif

#ifdef STM32F7xx
	static void prvCacheClean( uint32_t * pulAddress,
							   int32_t ulSize );
	static void prvCacheInvalidate( uint32_t * pulAddress,
									int32_t ulSize );
#else
	/* No cache: empty macro's. */
	#define prvCacheClean( pulAddress, ulSize )         do {} while( 0 )
	#define prvCacheInvalidate( pulAddress, ulSize )    do {} while( 0 )
#endif

/*-----------------------------------------------------------*/

typedef struct
{
	/* Only after a card has been inserted, debouncing is necessary. */
	TickType_t xRemainingTime;
	TimeOut_t xTimeOut;
	UBaseType_t
		bLastPresent : 1,
		bStableSignal : 1;
} CardDetect_t;

/* Used to handle timeouts. */
static TickType_t xDMARemainingTime;
static TimeOut_t xDMATimeOut;

/* Used to unblock the task that calls prvEventWaitFunction() after an event has
 * occurred. */
static SemaphoreHandle_t xSDCardSemaphore = NULL;

/* Handle of the SD card being used. */
SD_HandleTypeDef xSDHandle;

/* Holds parameters for the detected SD card. */
static HAL_SD_CardInfoTypedef xSDCardInfo;

/* Mutex for partition. */
static SemaphoreHandle_t xPlusFATMutex = NULL;

/* Remembers if the card is currently considered to be present. */
static BaseType_t xSDCardStatus = pdFALSE;

/* Maintains state for card detection. */
static CardDetect_t xCardDetect;

static __attribute__( ( section( ".first_data" ) ) ) uint8_t pucDMABuffer[ 512 ] __attribute__( ( aligned( 32 ) ) );

/*-----------------------------------------------------------*/

#ifdef STM32F7xx
	static BaseType_t xIsCachable( uint32_t ulAddress )
	{
		BaseType_t xReturn = pdFALSE;

		/* Is D-cache enabled? */
		if( ( SCB->CCR & ( uint32_t ) SCB_CCR_DC_Msk ) != 0U )
		{
			/* Is this a cacheable area? */
			if( ( ulAddress >= RAMDTCM_BASE + 0x10000 ) && ( ulAddress < RAMDTCM_BASE + 0x4CC00 ) )
			{
				xReturn = pdTRUE;
			}
		}

		return xReturn;
	}
#else /* ifdef STM32F7xx */
	static BaseType_t xIsCachable( uint32_t ulAddress )
	{
		return pdFALSE;
	}
/*-----------------------------------------------------------*/
#endif /* STM32F7xx */

static int32_t prvFFRead( uint8_t * pucBuffer,
						  uint32_t ulSectorNumber,
						  uint32_t ulSectorCount,
						  FF_Disk_t * pxDisk )
{
	int32_t lReturnCode = FF_ERR_IOMAN_OUT_OF_BOUNDS_READ | FF_ERRFLAG;

#warning remove this debugging
TickType_t ulStartTime = xTaskGetTickCount ();
	if( ( pxDisk != NULL ) &&
		( xSDCardStatus == pdPASS ) &&
		( pxDisk->ulSignature == sdSIGNATURE ) &&
		( pxDisk->xStatus.bIsInitialised != pdFALSE ) &&
		( ulSectorNumber < pxDisk->ulNumberOfSectors ) &&
		( ( pxDisk->ulNumberOfSectors - ulSectorNumber ) >= ulSectorCount ) )
	{
		uint64_t ullReadAddr;
		HAL_SD_ErrorTypedef sd_result;

		ullReadAddr = ( uint64_t ) 512U * ( uint64_t ) ulSectorNumber;

		#if ( SDIO_USES_DMA == 0 )
			{
				sd_result = HAL_SD_ReadBlocks( &xSDHandle, ( uint32_t * ) pucBuffer, ullReadAddr, ulSectorCount );
			}
		#else
			{
				/* Is the buffer aligned with a cache line? */
				if( ( ( ( uintptr_t ) pucBuffer ) & CACHE_LINE_BITS ) == 0U && pdFALSE )
				{
					/* The buffer is word-aligned, call DMA read directly. */
					sd_result = HAL_SD_ReadBlocks_DMA( &xSDHandle, ( uint32_t * ) pucBuffer, ullReadAddr, ulSectorCount );
eventLogAdd("Rd_DMA sng %u %04X", sd_result, ((unsigned)pucBuffer) >> 16);
					if( sd_result == SD_OK )
					{
						sd_result = HAL_SD_CheckReadOperation( &xSDHandle, sdMAX_TIME_TICKS );
eventLogAdd("Rd_chk sng %u", sd_result);

						if( xIsCachable( ( uint32_t ) pucBuffer ) != pdFALSE )
						{
							prvCacheInvalidate( ( uint32_t * ) pucBuffer, 512U * ulSectorCount );
						}
					}
				}
				else
				{
					uint32_t ulSector;

					/* The buffer is NOT word-aligned, copy first to an aligned buffer. */
					sd_result = SD_OK;

					for( ulSector = 0; ulSector < ulSectorCount; ulSector++ )
					{
						ullReadAddr = ( uint64_t ) 512U * ( ( uint64_t ) ulSectorNumber + ( uint64_t ) ulSector );
						sd_result = HAL_SD_ReadBlocks_DMA( &xSDHandle, ( uint32_t * ) pucDMABuffer, ullReadAddr, 1U );
eventLogAdd("Rd_DMA mul %u %04X", sd_result, ((unsigned)pucDMABuffer) >> 16);

						if( sd_result == SD_OK )
						{
							sd_result = HAL_SD_CheckReadOperation( &xSDHandle, sdMAX_TIME_TICKS );
eventLogAdd("Rd_chk mul %u", sd_result);

							if( sd_result != SD_OK )
							{
								break;
							}

							if( xIsCachable( ( uint32_t ) pucDMABuffer ) != pdFALSE )
							{
								prvCacheInvalidate( ( uint32_t * ) pucDMABuffer, 512U );
							}

							memcpy( pucBuffer + 512U * ulSector, pucDMABuffer, 512U );
						}
					}
				}
			}
		#endif /* SDIO_USES_DMA */

		if( sd_result == SD_OK )
		{
			lReturnCode = 0L;
		}
		else
		{
			/* Some error occurred. */
			TickType_t ulEndTime = xTaskGetTickCount ();
			TickType_t ulDiff = ulEndTime - ulStartTime;
eventLogAdd("prvFFRead %u ms", (unsigned)ulDiff );
			FF_PRINTF( "prvFFRead: %lu: %lu (%s)\n", ulSectorNumber, sd_result, prvSDCodePrintable( sd_result ) );
			FF_PRINTF( "prvFFRead: After %u ms\n", ulDiff );
		}
	}
	else
	{
		/* Make sure no random data is in the returned buffer. */
		memset( ( void * ) pucBuffer, '\0', ulSectorCount * 512U );

		if( pxDisk->xStatus.bIsInitialised != pdFALSE )
		{
			FF_PRINTF( "prvFFRead: warning: %lu + %lu > %lu\n", ulSectorNumber, ulSectorCount, pxDisk->ulNumberOfSectors );
		}
	}

	return lReturnCode;
}
/*-----------------------------------------------------------*/

static int32_t prvFFWrite( uint8_t * pucBuffer,
						   uint32_t ulSectorNumber,
						   uint32_t ulSectorCount,
						   FF_Disk_t * pxDisk )
{
	int32_t lReturnCode = FF_ERR_IOMAN_OUT_OF_BOUNDS_READ | FF_ERRFLAG;

