htibosch/freertos_plus_projects/plus/Framework/FreeRTOS-Plus-FAT/portable/STM32F7xx/ff_sddisk.older.c
FF_Disk_t * FF_SDDiskInit( const char * pcName )
{
	FF_Error_t xFFError;
	BaseType_t xPartitionNumber = 0;
	FF_CreationParameters_t xParameters;
	FF_Disk_t * pxDisk;

	xSDCardStatus = prvSDMMCInit( 0 );

	if( xSDCardStatus != pdPASS )
	{
		FF_PRINTF( "FF_SDDiskInit: prvSDMMCInit failed\n" );
		pxDisk = NULL;
	}
	else
	{
		pxDisk = ( FF_Disk_t * ) ffconfigMALLOC( sizeof( *pxDisk ) );

		if( pxDisk == NULL )
		{
			FF_PRINTF( "FF_SDDiskInit: Malloc failed\n" );
		}
		else
		{
			/* Initialise the created disk structure. */
			memset( pxDisk, '\0', sizeof( *pxDisk ) );

			pxDisk->ulNumberOfSectors = xSDCardInfo.CardCapacity / 512;

			if( xPlusFATMutex == NULL )
			{
				xPlusFATMutex = xSemaphoreCreateRecursiveMutex();
			}

			pxDisk->ulSignature = sdSIGNATURE;

			if( xPlusFATMutex != NULL )
			{
				uint32_t pulCacheMemory =
					( uint32_t ) ffconfigMALLOC( sdIOMAN_MEM_SIZE + CACHE_LINE_SIZE );

				if( pulCacheMemory != NULL )
				{
					/* Make sure the buffer is aligned with a 32-byte cache line. */
					pulCacheMemory = pulCacheMemory + CACHE_LINE_SIZE;
					/* Clear the last 5 bits. */
					pulCacheMemory &= ~( ( uint32_t ) CACHE_LINE_BITS );

					memset( &xParameters, '\0', sizeof( xParameters ) );
					xParameters.ulMemorySize = sdIOMAN_MEM_SIZE;
					xParameters.ulSectorSize = 512;
					xParameters.fnWriteBlocks = prvFFWrite;
					xParameters.fnReadBlocks = prvFFRead;
					xParameters.pxDisk = pxDisk;
					xParameters.pucCacheMemory = ( uint8_t * ) pulCacheMemory;

					/* prvFFRead()/prvFFWrite() are not re-entrant and must be
					 * protected with the use of a semaphore. */
					xParameters.xBlockDeviceIsReentrant = pdFALSE;

					/* The semaphore will be used to protect critical sections in
					 * the +FAT driver, and also to avoid concurrent calls to
					 * prvFFRead()/prvFFWrite() from different tasks. */
					xParameters.pvSemaphore = ( void * ) xPlusFATMutex;

					pxDisk->pxIOManager = FF_CreateIOManger( &xParameters, &xFFError );

					if( pxDisk->pxIOManager == NULL )
					{
						FF_PRINTF( "FF_SDDiskInit: FF_CreateIOManger: %s\n", ( const char * ) FF_GetErrMessage( xFFError ) );
						FF_SDDiskDelete( pxDisk );
						pxDisk = NULL;
					}
					else
					{
						pxDisk->xStatus.bIsInitialised = pdTRUE;
						pxDisk->xStatus.bPartitionNumber = xPartitionNumber;

						if( FF_SDDiskMount( pxDisk ) == 0 )
						{
							FF_SDDiskDelete( pxDisk );
							pxDisk = NULL;
						}
						else
						{
							if( pcName == NULL )
							{
								pcName = "/";
							}

							FF_FS_Add( pcName, pxDisk );
							FF_PRINTF( "FF_SDDiskInit: Mounted SD-card as root \"%s\"\n", pcName );
							FF_SDDiskShowPartition( pxDisk );
						}
					} /* if( pxDisk->pxIOManager != NULL ) */
				}
				else  /* pucCacheMemory == NULL */
				{
					FF_PRINTF( "FF_SDDiskInit: Malloc cache %u failed\n", ( unsigned ) sdIOMAN_MEM_SIZE );
				}
			} /* if( xPlusFATMutex != NULL) */
		}     /* if( pxDisk != NULL ) */
	}         /* if( xSDCardStatus == pdPASS ) */

	return pxDisk;
}
/*-----------------------------------------------------------*/

BaseType_t FF_SDDiskFormat( FF_Disk_t * pxDisk,
							BaseType_t xPartitionNumber )
{
	FF_Error_t xError;
	BaseType_t xReturn = pdFAIL;

	xError = FF_Unmount( pxDisk );

	if( FF_isERR( xError ) != pdFALSE )
	{
		FF_PRINTF( "FF_SDDiskFormat: unmount fails: %08x\n", ( unsigned ) xError );
	}
	else
	{
		/* Format the drive - try FAT32 with large clusters. */
		xError = FF_Format( pxDisk, xPartitionNumber, pdFALSE, pdFALSE );

		if( FF_isERR( xError ) )
		{
			FF_PRINTF( "FF_SDDiskFormat: %s\n", ( const char * ) FF_GetErrMessage( xError ) );
		}
		else
		{
			FF_PRINTF( "FF_SDDiskFormat: OK, now remounting\n" );
			pxDisk->xStatus.bPartitionNumber = xPartitionNumber;
			xError = FF_SDDiskMount( pxDisk );
			FF_PRINTF( "FF_SDDiskFormat: rc %08x\n", ( unsigned ) xError );

			if( FF_isERR( xError ) == pdFALSE )
			{
				xReturn = pdPASS;
				FF_SDDiskShowPartition( pxDisk );
			}
		}
	}

	return xReturn;
}
/*-----------------------------------------------------------*/

BaseType_t FF_SDDiskUnmount( FF_Disk_t * pxDisk )
{
	FF_Error_t xFFError;
	BaseType_t xReturn = pdPASS;

	if( ( pxDisk != NULL ) && ( pxDisk->xStatus.bIsMounted != pdFALSE ) )
	{
		pxDisk->xStatus.bIsMounted = pdFALSE;
		xFFError = FF_Unmount( pxDisk );

		if( FF_isERR( xFFError ) )
		{
			FF_PRINTF( "FF_SDDiskUnmount: rc %08x\n", ( unsigned ) xFFError );
			xReturn = pdFAIL;
		}
		else
		{
			FF_PRINTF( "Drive unmounted\n" );
		}
	}

	return xReturn;
}
/*-----------------------------------------------------------*/

BaseType_t FF_SDDiskReinit( FF_Disk_t * pxDisk )
{
	BaseType_t xStatus = prvSDMMCInit( 0 ); /* Hard coded index. */

	/*_RB_ parameter not used. */
	( void ) pxDisk;

	FF_PRINTF( "FF_SDDiskReinit: rc %08x\n", ( unsigned ) xStatus );
	return xStatus;
}
/*-----------------------------------------------------------*/

BaseType_t FF_SDDiskMount( FF_Disk_t * pxDisk )
{
	FF_Error_t xFFError;
	BaseType_t xReturn;

	/* Mount the partition */
	xFFError = FF_Mount( pxDisk, pxDisk->xStatus.bPartitionNumber );

	if( FF_isERR( xFFError ) )
	{
		FF_PRINTF( "FF_SDDiskMount: %08lX\n", xFFError );
		xReturn = pdFAIL;
	}
	else
	{
		pxDisk->xStatus.bIsMounted = pdTRUE;
		FF_PRINTF( "****** FreeRTOS+FAT initialized %lu sectors\n", pxDisk->pxIOManager->xPartition.ulTotalSectors );
		xReturn = pdPASS;
	}

	return xReturn;
}
/*-----------------------------------------------------------*/

FF_IOManager_t * sddisk_ioman( FF_Disk_t * pxDisk )
{
	FF_IOManager_t * pxReturn;

	if( ( pxDisk != NULL ) && ( pxDisk->xStatus.bIsInitialised != pdFALSE ) )
	{
		pxReturn = pxDisk->pxIOManager;
	}
	else
	{
		pxReturn = NULL;
	}

	return pxReturn;
}
/*-----------------------------------------------------------*/

/* Release all resources */
BaseType_t FF_SDDiskDelete( FF_Disk_t * pxDisk )
{
	if( pxDisk != NULL )
	{
		pxDisk->ulSignature = 0;
		pxDisk->xStatus.bIsInitialised = 0;

		if( pxDisk->pxIOManager != NULL )
		{
			if( FF_Mounted( pxDisk->pxIOManager ) != pdFALSE )
			{
				FF_Unmount( pxDisk );
			}

			FF_DeleteIOManager( pxDisk->pxIOManager );
		}

		vPortFree( pxDisk );
	}

	return 1;
}
/*-----------------------------------------------------------*/

BaseType_t FF_SDDiskShowPartition( FF_Disk_t * pxDisk )
{
	FF_Error_t xError;
	uint64_t ullFreeSectors;
	uint32_t ulTotalSizeMB, ulFreeSizeMB;
	int iPercentageFree;
	FF_IOManager_t * pxIOManager;
	const char * pcTypeName = "unknown type";
	BaseType_t xReturn = pdPASS;

	if( pxDisk == NULL )
	{
		xReturn = pdFAIL;
	}
	else
	{
		pxIOManager = pxDisk->pxIOManager;

